rainbowbloodyrainbow/ForTICup/VisionTransmit/sdkconfig.defaults
# ESP32-S3, 16 MB Quad Flash at 80 MHz in QIO mode.
CONFIG_IDF_TARGET="esp32s3"
# CONFIG_ESPTOOLPY_OCT_FLASH is not set
# CONFIG_ESPTOOLPY_FLASH_MODE_AUTO_DETECT is not set
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# 8 MB Octal PSRAM at 80 MHz; initialization failure is fatal.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
# CONFIG_SPIRAM_IGNORE_NOTFOUND is not set

# ESP32-S3 camera DMA directly into PSRAM.
CONFIG_CAMERA_PSRAM_DMA=y

# Performance settings.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
